"""
描述
对于给定的由大小写字母、数字和空格混合构成的字符串 
s
s，给定字符 
c
c，按要求统计：
∙
 
∙若 
c
c 为大写或者小写字母，统计其大小写形态出现的次数和；
∙
 
∙若 
c
c 为数字，统计其出现的次数。

保证字符 
c
c 要么为字母、要么为数字。
输入描述：
第一行输入一个长度 
1
≦
l
e
n
g
t
h
(
s
)
≦
1
0
3
1≦length(s)≦10 
3
 ，由大小写字母、数字和空格构成的字符串 
s
s。保证首尾不为空格。
第二行输入一个字符 
c
c，保证 
c
c 为大小写字母或数字。
输出描述：
在一行上输出一个整数，代表统计结果。
示例1
输入：
HELLONowcoder123
o
复制
输出：
3
复制
说明：
由于 
o
o 为小写字母，因此统计其大小写形态出现的次数和，即 
3
3。
示例2
输入：
H E L L O Nowcoder123
1
复制
输出：
1
复制
"""

st1 = input().lower()   # 统一转换为小写 注意用法
st2 = input().lower()   # 统一转换为小写 注意用法
print(st1.count(st2))   # 统计st2在st1中出现的次数 注意用法
